import React, { SVGProps } from 'react';

const RenewIcon = ({ color = '#283039', ...props }: SVGProps<SVGSVGElement>) => {
  return (
    <svg width="10px" height="15px" viewBox="0 0 10 15" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlnsXlink="http://www.w3.org/1999/xlink" {...props}>
      <g id="↪️-All-screens" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
        <g id="Home-site-device-management_screen-mode" transform="translate(-709.000000, -750.000000)" fill={color} fillRule="nonzero">
          <g id="autorenew-24px" transform="translate(709.000000, 750.000000)">
            <path
              d="M5.03888889,3.84545455 L5.03888889,5.67272727 L7.45833333,3.23636364 L5.03888889,0.8 L5.03888889,2.62727273 C2.36540278,2.62727273 0.2,4.80781818 0.2,7.5 C0.2,8.45627273 0.478236111,9.34554545 0.950027778,10.0947273 L1.833125,9.20545455 C1.5609375,8.69990909 1.40972222,8.11518182 1.40972222,7.5 C1.40972222,5.48390909 3.03679861,3.84545455 5.03888889,3.84545455 Z M9.12775,4.90527273 L8.24465278,5.79454545 C8.51079167,6.30618182 8.66805556,6.88481818 8.66805556,7.5 C8.66805556,9.51609091 7.04097917,11.1545455 5.03888889,11.1545455 L5.03888889,9.32727273 L2.61944444,11.7636364 L5.03888889,14.2 L5.03888889,12.3727273 C7.712375,12.3727273 9.87777778,10.1921818 9.87777778,7.5 C9.87777778,6.54372727 9.59954167,5.65445455 9.12775,4.90527273 L9.12775,4.90527273 Z"
              id="Shape"
            ></path>
          </g>
        </g>
      </g>
    </svg>
  );
};

export default RenewIcon;
